app/controllers/admin/posts_controller.rb

SELECT  "posts".* FROM "posts" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    @posts = Post.paginate(:page => params[:page], :per_page => 10)

UPDATE "posts" SET "status" = $1, "slug" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["status", "active"], ["slug", "five"], ["updated_at", "2015-07-16 08:40:58.866359"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)