app/views/posts/index.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('adminka'))
---
        <td><%= post.created_at.strftime '%d.%m.%Y' %></td>
        <td><% post.tags.any? %>