app/controllers/posts_controller.rb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('adminka'))
SELECT  "posts".* FROM "posts" LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "posts"
---
  def index
    if params[:tag].present?
      @posts = Post.active.tagged_with(params[:tag]).paginate(:page => params[:page], :per_page => 10)

INSERT INTO "posts" ("title", "content", "user_id", "status", "slug", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "test"], ["content", "test test"], ["user_id", 1], ["status", "deactivate"], ["slug", "test"], ["created_at", "2015-07-16 08:51:50.022786"], ["updated_at", "2015-07-16 08:51:50.022786"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id
    @post.status = "deactivate"

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "content" = $1, "slug" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["content", "text text edit"], ["slug", "firsr"], ["updated_at", "2015-07-16 07:48:12.760430"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)