app/controllers/roles_controller.rb

  def create
    @role = Role.new(role_params)

    respond_to do |format|
      if @role.save
---
INSERT INTO "roles" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "user"], ["description", ""], ["created_at", "2015-07-07 14:39:44.049585"], ["updated_at", "2015-07-07 14:39:44.049585"]]